{
  "name": "David Pettit",
  "title": "Software Developer",
  "contact_email": "dkpettit@gmail.com",
  "github_handle": "Dkpettit",
  "education": {
    "school": "Fanshawe College",
    "degree": "Computer Programmer Analyst",
    "graduated": "December 2020"
  },
  "jobs": [
    {
      "company": {
        "name": "Canada Life",
        "website": "https://canadalife.com"
      },
      "positions": [
        {
          "title": "Software Developer",
          "duration": "September 2019 &mdash; Present"
        }
      ],
      "description": "Development tasks related to a suite of “Illustration” software at Canada Life, used to “Illustrate” customer insurance policies.",
      "accomplishments": [
        "Work to migrate and update legacy software applications (VBA, VB6, C++Borland, and others) to more modern technology (c#.net, web based technology)",
        "Introduced .net service components calling Web Services as reference in existing MSAccess applications -- removing their dependence on stored procedure calls to pass through tables in Sybase Databases that had gone out of support",
        "Introduced security updates to out of support applications such as .net updates and TLS1.2 vs. TLS1.0 ",
        "Analyze existing pre-requisites and dependencies in entire suite of ‘owned’ applications for out of support technology and components.s",
        "Work independently across multiple projects with conflicting timelines in a demanding environment tracking my efforts and responsibilities with JIRA ",
        "Communicate through Confluence to collaborate with stakeholders at all levels",
        "Development and testing of features, components committing regularly to Bitbucket and Gitlab",
        "Create and maintain documentation and Job Aids related to software, as well as provide all documentation to projects as required (T2M, Estimates, ARP’s, etc.)",
        "Partner with, manage and support off-shore developers ",
        "Team security coordinator",
        "Disaster Recovery Team Lead 2023",
        "Disaster Recovery SPOC/SME 2020-2022",
        "Coordinate exception requests, in support of legacy software dependencies",
        "Request, deploy, configure and manage Servers, Network devices, test machines, Firewalls, Firewall rules, CSS certs, Ansible, Security/Vulnerability scans",
        "Work with Developers, Technicians, Architects, Specialists to support everything above"
      ]
    }
  ],
  "projects": [
    {
      "name": "Dave Pettit's TV Show Collection",
      "website": "https://mernappdave-7eca150cce5f.herokuapp.com/login",
      "code": "https://github.com/Dkpettit/mern-shows",
      "description": "A MERN application that tracks what shows a user is watching, Users are authenticated against a MongoDB users database, assigned a JWT and logged in and out.  A user object is created in localstorage that can be accessed in the App.  Users can search for TV shows via a search that makes a call to an IMDB API exposed on RapidAPI.  Results are displayed in a React component and selected Shows can be added to the Shows DB on Mongo which stores the name, id, and poster url for the show."
    },
    {
      "name": "Under Construction",
      "website": "",
      "code": "",
      "description": ""
    },
    {
      "name": "Under Construction",
      "website": "",
      "code": "",
      "description": ""
    }
  ],
  "skills": {
    "Front_End": [
      "JavaScript",
      "HTML",
      "NPM/Yarn",
      "Bootstrap",
      "Sass",
      "CSS",
      "jQuery"
    ],
    "Back_End": [
      "REST APIs",
      "MySQL",
      "AWS",
      "Django",
      "Node",
      "React",
      "Laravel",
      "Express"
    ],
    "Tools": [
      "Confluence",
      "Git",
      "GitHub",
      "Jira",
      "Bitbucket",
      "Heroku",
      "Digital Ocean",
      "Linux",
      "Ansible",
      "JSON/YAML/XML"
    ]
  }
}
